In [3]:
import pandas as pd

Introduction to pandas Data Structures
#####Series######

In [4]:
s1=pd.Series([11,22,33,44,55,66,77,88,99,10])

In [5]:
s1

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
9    10
dtype: int64

In [6]:
#index(0-9 default index given by series object)

In [7]:
s1[9] #Accessing  value by index

10

In [8]:
s1[[2,4,7,9,0]] #Accessing multiple values

2    33
4    55
7    88
9    10
0    11
dtype: int64

In [9]:
s1[9]=100

In [10]:
s1

0     11
1     22
2     33
3     44
4     55
5     66
6     77
7     88
8     99
9    100
dtype: int64

In [11]:
del s1[9] #deleting values in series
s1

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
dtype: int64

In [12]:
s1[5]=555 #modifying a value in series
s1[2,3,4,5]=[222,333,444,555]
s1

0     11
1     22
2    222
3    333
4    444
5    555
6     77
7     88
8     99
dtype: int64

In [13]:
del s1[1,6,7]

KeyError: (1, 6, 7)

In [14]:
s1[99]=999 #insert in a series with a new index
s1

0      11
1      22
2     222
3     333
4     444
5     555
6      77
7      88
8      99
99    999
dtype: int64

In [15]:
s2=pd.Series([10,20,30,40],index=["oranges","apples","bananas","mango"])
s2

oranges    10
apples     20
bananas    30
mango      40
dtype: int64

In [16]:
s2.index

Index(['oranges', 'apples', 'bananas', 'mango'], dtype='object')

In [17]:
s2.values

array([10, 20, 30, 40], dtype=int64)

In [18]:
ourindex=["oranges","apples","bananas","mango"]
s3=pd.Series([10,20,30,40],index=ourindex)

In [19]:
s3

oranges    10
apples     20
bananas    30
mango      40
dtype: int64

In [20]:
s2>30

oranges    False
apples     False
bananas    False
mango       True
dtype: bool

In [21]:
s2[s2<30]

oranges    10
apples     20
dtype: int64

In [22]:
s1[s1>99]

2     222
3     333
4     444
5     555
99    999
dtype: int64

In [23]:
'peech' in s2 #checking if requirred key is in Series or not

False

In [24]:
'mango' in s2

True

# Creating a Series by using a Dictionary

In [25]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
data=pd.Series(sdata)
data

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
data1=pd.Series(sdata,index=states)
data1

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
NaN (not a number) #missing

SyntaxError: invalid syntax (<ipython-input-27-33f8d84c3516>, line 1)

In [28]:
data1['California']=34000

In [29]:
data1

California    34000.0
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [30]:
cities={'khi':1,'hyd':2,'lahore':3}
cities

{'khi': 1, 'hyd': 2, 'lahore': 3}

In [31]:
data=pd.Series(cities)
data

khi       1
hyd       2
lahore    3
dtype: int64

In [32]:
data1.isnull()

California    False
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [33]:
data1.notnull()

California    True
Ohio          True
Oregon        True
Texas         True
dtype: bool

# Data Frame

In [34]:
data = {
        'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
        }

df1=pd.DataFrame(data)
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [35]:
type(df1)

pandas.core.frame.DataFrame

In [36]:
df1.shape

(6, 3)

In [37]:
data1={
     'Book_id':[1,2,3,4],
     'Authors':['Shakespear','Howard Anton','Robert lafore','Elsa kazi'],
     'Books':['Success','Calculus','C-Language','Sky'],
     'Edition':['19th' , '10th' , '9th','8th'],
     'Pages':[300,600,1200,700]
    
}
df2=pd.DataFrame(data1)
df2

   Book_id        Authors       Books Edition  Pages
0        1     Shakespear     Success    19th    300
1        2   Howard Anton    Calculus    10th    600
2        3  Robert lafore  C-Language     9th   1200
3        4      Elsa kazi         Sky     8th    700

In [38]:
df1['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [39]:
df1[['pop',"year"]] #selecting multiple columns by column header

   pop  year
0  1.5  2000
1  1.7  2001
2  3.6  2002
3  2.4  2001
4  2.9  2002
5  3.2  2003

In [40]:
del df1["pop"]  #deleting a column
df1

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5  Nevada  2003

In [41]:
df1["debt"]=200
df1

    state  year  debt
0    Ohio  2000   200
1    Ohio  2001   200
2    Ohio  2002   200
3  Nevada  2001   200
4  Nevada  2002   200
5  Nevada  2003   200

In [42]:
df1["debt"]=[100,200,300,100,800,500]
df1

    state  year  debt
0    Ohio  2000   100
1    Ohio  2001   200
2    Ohio  2002   300
3  Nevada  2001   100
4  Nevada  2002   800
5  Nevada  2003   500

In [43]:
df1['debt']=range(1,7)
df1

    state  year  debt
0    Ohio  2000     1
1    Ohio  2001     2
2    Ohio  2002     3
3  Nevada  2001     4
4  Nevada  2002     5
5  Nevada  2003     6

In [44]:
dic={
    "AI FOR EVERYONE":[78,89,98,90,87,86,67,89],
    "Python1":[90,78,87,89,98,78,76,75],
    "Python2":[59,90,87,38,10,98,81,83]
   }
df=pd.DataFrame(dic,index=["Rabia" ,"Yusra","Naureen","Maheen","Tooba","Iqra","Hadiya","Muniba"])
df

         AI FOR EVERYONE  Python1  Python2
Rabia                 78       90       59
Yusra                 89       78       90
Naureen               98       87       87
Maheen                90       89       38
Tooba                 87       98       10
Iqra                  86       78       98
Hadiya                67       76       81
Muniba                89       75       83

In [45]:
df['Total']=df['AI FOR EVERYONE']+df['Python1']+df['Python2']
df

         AI FOR EVERYONE  Python1  Python2  Total
Rabia                 78       90       59    227
Yusra                 89       78       90    257
Naureen               98       87       87    272
Maheen                90       89       38    217
Tooba                 87       98       10    195
Iqra                  86       78       98    262
Hadiya                67       76       81    224
Muniba                89       75       83    247

In [46]:
df['pass']=df['Total']>200 
df

         AI FOR EVERYONE  Python1  Python2  Total   pass
Rabia                 78       90       59    227   True
Yusra                 89       78       90    257   True
Naureen               98       87       87    272   True
Maheen                90       89       38    217   True
Tooba                 87       98       10    195  False
Iqra                  86       78       98    262   True
Hadiya                67       76       81    224   True
Muniba                89       75       83    247   True

In [47]:
for i in range(8):
    if 'pass'=='True':
        df['status']='Pass'
    else:
        df['status']='Fail'
df

         AI FOR EVERYONE  Python1  Python2  Total   pass status
Rabia                 78       90       59    227   True   Fail
Yusra                 89       78       90    257   True   Fail
Naureen               98       87       87    272   True   Fail
Maheen                90       89       38    217   True   Fail
Tooba                 87       98       10    195  False   Fail
Iqra                  86       78       98    262   True   Fail
Hadiya                67       76       81    224   True   Fail
Muniba                89       75       83    247   True   Fail

In [48]:
df['status']=["Pass" if marks>=200 else "Fails" for marks in df.Total]
df

         AI FOR EVERYONE  Python1  Python2  Total   pass status
Rabia                 78       90       59    227   True   Pass
Yusra                 89       78       90    257   True   Pass
Naureen               98       87       87    272   True   Pass
Maheen                90       89       38    217   True   Pass
Tooba                 87       98       10    195  False  Fails
Iqra                  86       78       98    262   True   Pass
Hadiya                67       76       81    224   True   Pass
Muniba                89       75       83    247   True   Pass

In [49]:
df['status']=["Pass"if a>33 and p1>33 and p2>33 else "Fails" for a,p1,p2 in zip(df['AI FOR EVERYONE'],df['Python1'],df['Python2'])]
df

         AI FOR EVERYONE  Python1  Python2  Total   pass status
Rabia                 78       90       59    227   True   Pass
Yusra                 89       78       90    257   True   Pass
Naureen               98       87       87    272   True   Pass
Maheen                90       89       38    217   True   Pass
Tooba                 87       98       10    195  False  Fails
Iqra                  86       78       98    262   True   Pass
Hadiya                67       76       81    224   True   Pass
Muniba                89       75       83    247   True   Pass

In [50]:
a=list(range(5))
b=list(range(6,11))
a

[0, 1, 2, 3, 4]

In [51]:
b

[6, 7, 8, 9, 10]

In [52]:
c=zip(a,b)
for i in c:
    print(i)

(0, 6)
(1, 7)
(2, 8)
(3, 9)
(4, 10)

In [53]:
df.head()

         AI FOR EVERYONE  Python1  Python2  Total   pass status
Rabia                 78       90       59    227   True   Pass
Yusra                 89       78       90    257   True   Pass
Naureen               98       87       87    272   True   Pass
Maheen                90       89       38    217   True   Pass
Tooba                 87       98       10    195  False  Fails

In [54]:
df.tail() #return last 5 rows

        AI FOR EVERYONE  Python1  Python2  Total   pass status
Maheen               90       89       38    217   True   Pass
Tooba                87       98       10    195  False  Fails
Iqra                 86       78       98    262   True   Pass
Hadiya               67       76       81    224   True   Pass
Muniba               89       75       83    247   True   Pass

In [55]:
df.tail(3)

        AI FOR EVERYONE  Python1  Python2  Total  pass status
Iqra                 86       78       98    262  True   Pass
Hadiya               67       76       81    224  True   Pass
Muniba               89       75       83    247  True   Pass

In [56]:
df.head(2)

       AI FOR EVERYONE  Python1  Python2  Total  pass status
Rabia               78       90       59    227  True   Pass
Yusra               89       78       90    257  True   Pass

In [57]:
df.loc['Yusra']

AI FOR EVERYONE      89
Python1              78
Python2              90
Total               257
pass               True
status             Pass
Name: Yusra, dtype: object

In [58]:
df.iloc[0:7] #iloc>>>last one not inclusive

         AI FOR EVERYONE  Python1  Python2  Total   pass status
Rabia                 78       90       59    227   True   Pass
Yusra                 89       78       90    257   True   Pass
Naureen               98       87       87    272   True   Pass
Maheen                90       89       38    217   True   Pass
Tooba                 87       98       10    195  False  Fails
Iqra                  86       78       98    262   True   Pass
Hadiya                67       76       81    224   True   Pass